; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-33)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 27 of 33
2. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 27 of 33
3. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 27 of 33
4. (pick ball19 room4 right)
   deleted: (at ball19 room4) (free right)
   added: (carry ball19 right)
   goals met: 27 of 33
5. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 27 of 33
6. (drop ball19 room3 right)
   deleted: (carry ball19 right)
   added: (at ball19 room3) (free right)
   goals met: 28 of 33
7. (drop ball10 room3 left)
   deleted: (carry ball10 left)
   added: (at ball10 room3) (free left)
   goals met: 29 of 33
8. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 29 of 33
9. (pick ball18 room4 left)
   deleted: (at ball18 room4) (free left)
   added: (carry ball18 left)
   goals met: 29 of 33
10. (pick ball17 room4 right)
   deleted: (at ball17 room4) (free right)
   added: (carry ball17 right)
   goals met: 29 of 33
11. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 29 of 33
12. (drop ball17 room3 right)
   deleted: (carry ball17 right)
   added: (at ball17 room3) (free right)
   goals met: 30 of 33
13. (drop ball18 room3 left)
   deleted: (carry ball18 left)
   added: (at ball18 room3) (free left)
   goals met: 31 of 33
14. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 31 of 33
15. (pick ball16 room4 left)
   deleted: (at ball16 room4) (free left)
   added: (carry ball16 left)
   goals met: 31 of 33
16. (pick ball15 room4 right)
   deleted: (at ball15 room4) (free right)
   added: (carry ball15 right)
   goals met: 31 of 33
17. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 31 of 33
18. (drop ball16 room3 left)
   deleted: (carry ball16 left)
   added: (at ball16 room3) (free left)
   goals met: 32 of 33
19. (drop ball15 room3 right)
   deleted: (carry ball15 right)
   added: (at ball15 room3) (free right)
   goals met: 33 of 33
